; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s2-p7-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l1-0 l1-1 l2-0 l2-1 l3-0 l3-1 l4-0 l4-1 
          p0 p1 p2 p3 p4 p5 p6 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (at t0 l0-1)
    (at t1 l1-1)
    (at t2 l2-1)
    (at t3 l3-0)
    (at t4 l4-1)
    (at p0 l1-1)
    (at p1 l2-1)
    (at p2 l4-1)
    (at p3 l2-1)
    (at p4 l3-0)
    (at p5 l3-1)
    (at p6 l2-0)
    (at a0 l3-0)
)
(:goal
    (and
        (at p0 l3-0)
        (at p1 l2-0)
        (at p2 l4-1)
        (at p3 l0-1)
        (at p4 l4-1)
        (at p5 l4-1)
        (at p6 l1-1)
    )
)

  (:constraints
    (and
      (always (not (in p1 a0)))
      (always (not (in p2 a0)))
    )
  )
)

; plan
1. (load-airplane p4 a0 l3-0)
   deleted: (at p4 l3-0)
   added: (in p4 a0)
   goals met: 1 of 7
2. (load-truck p3 t2 l2-1)
   deleted: (at p3 l2-1)
   added: (in p3 t2)
   goals met: 1 of 7
3. (load-truck p1 t2 l2-1)
   deleted: (at p1 l2-1)
   added: (in p1 t2)
   goals met: 1 of 7
4. (load-truck p0 t1 l1-1)
   deleted: (at p0 l1-1)
   added: (in p0 t1)
   goals met: 1 of 7
5. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 1 of 7
6. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 7
7. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 1 of 7
8. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 1 of 7
9. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 1 of 7
10. (load-truck p5 t3 l3-1)
   deleted: (at p5 l3-1)
   added: (in p5 t3)
   goals met: 1 of 7
11. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 7
12. (unload-truck p3 t2 l2-0)
   deleted: (in p3 t2)
   added: (at p3 l2-0)
   goals met: 1 of 7
13. (unload-truck p1 t2 l2-0)
   deleted: (in p1 t2)
   added: (at p1 l2-0)
   goals met: 2 of 7
14. (unload-airplane p4 a0 l4-0)
   deleted: (in p4 a0)
   added: (at p4 l4-0)
   goals met: 2 of 7
15. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 2 of 7
16. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 2 of 7
17. (load-truck p4 t4 l4-0)
   deleted: (at p4 l4-0)
   added: (in p4 t4)
   goals met: 2 of 7
18. (unload-truck p5 t3 l3-0)
   deleted: (in p5 t3)
   added: (at p5 l3-0)
   goals met: 2 of 7
19. (fly-airplane a0 l4-0 l2-0)
   deleted: (at a0 l4-0)
   added: (at a0 l2-0)
   goals met: 2 of 7
20. (load-airplane p6 a0 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a0)
   goals met: 2 of 7
21. (load-airplane p3 a0 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a0)
   goals met: 2 of 7
22. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 2 of 7
23. (fly-airplane a0 l2-0 l4-0)
   deleted: (at a0 l2-0)
   added: (at a0 l4-0)
   goals met: 2 of 7
24. (unload-truck p4 t4 l4-1)
   deleted: (in p4 t4)
   added: (at p4 l4-1)
   goals met: 3 of 7
25. (fly-airplane a0 l4-0 l1-0)
   deleted: (at a0 l4-0)
   added: (at a0 l1-0)
   goals met: 3 of 7
26. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 3 of 7
27. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 3 of 7
28. (load-airplane p0 a0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a0)
   goals met: 3 of 7
29. (fly-airplane a0 l1-0 l4-0)
   deleted: (at a0 l1-0)
   added: (at a0 l4-0)
   goals met: 3 of 7
30. (load-truck p6 t1 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 t1)
   goals met: 3 of 7
31. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 3 of 7
32. (fly-airplane a0 l4-0 l0-0)
   deleted: (at a0 l4-0)
   added: (at a0 l0-0)
   goals met: 3 of 7
33. (unload-truck p6 t1 l1-1)
   deleted: (in p6 t1)
   added: (at p6 l1-1)
   goals met: 4 of 7
34. (unload-airplane p3 a0 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 4 of 7
35. (fly-airplane a0 l0-0 l4-0)
   deleted: (at a0 l0-0)
   added: (at a0 l4-0)
   goals met: 4 of 7
36. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 4 of 7
37. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 4 of 7
38. (fly-airplane a0 l4-0 l3-0)
   deleted: (at a0 l4-0)
   added: (at a0 l3-0)
   goals met: 4 of 7
39. (unload-truck p3 t0 l0-1)
   deleted: (in p3 t0)
   added: (at p3 l0-1)
   goals met: 5 of 7
40. (unload-airplane p0 a0 l3-0)
   deleted: (in p0 a0)
   added: (at p0 l3-0)
   goals met: 6 of 7
41. (load-airplane p5 a0 l3-0)
   deleted: (at p5 l3-0)
   added: (in p5 a0)
   goals met: 6 of 7
42. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 6 of 7
43. (unload-airplane p5 a0 l4-0)
   deleted: (in p5 a0)
   added: (at p5 l4-0)
   goals met: 6 of 7
44. (load-truck p5 t4 l4-0)
   deleted: (at p5 l4-0)
   added: (in p5 t4)
   goals met: 6 of 7
45. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 6 of 7
46. (unload-truck p5 t4 l4-1)
   deleted: (in p5 t4)
   added: (at p5 l4-1)
   goals met: 7 of 7
